A formula in a global parameter causes a circular chain of references between highlighted elements.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId GlobalParamFormulaCircularChainError { get; }
  Visual Basic
Public Shared ReadOnly Property GlobalParamFormulaCircularChainError As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ GlobalParamFormulaCircularChainError {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures GlobalParameterFailures Class
  Autodesk.Revit.DB Namespace